"""
案例:
    演示张量的基本运算

涉及到的API:
    add(), sub(), mul(), div(), neg()          -> 加减乘除,取反
    add_(), sub(), mul_(), div_(), neg_()       ->功能同上,只不过可以修改原数据,类似于pandas部分的 inplace = Ture

需要记住:
    1. 可以用 +,-,*,/ 符号来代替 上述的 加减乘除
    2. 如果是张量 和 数值 运算,则: 该数字会与张量中每一个数值进行对应运算
"""

#导包
import torch

# 1.创建张量
t1 = torch.tensor([1,2,3])

# 2.演示加法
# t2 = t1.add(10)         #不会修改原数据
# t2 = t1+10              #效果同上

# t1.add_(10)        #会修改原数据
# t1 += 10         #效果同上

#其他函数类似
# t2 = t1.sub(1)          #减法
# t2 = t1.mul(2)          #乘法
# t2 = t1.div(2)          #除法,[0.5000, 1.0000, 1.5000]
# t2 = t1.neg()           #取反

t2 = t1 // 2              #整除

#3.打印结果
print(t1)
print(t2)
