"""
案例:
    演示张量点乘 和 矩阵乘法

点乘:
    要求:两个张量 行列数(维度) 保持一致,对应元素直接做相应的操作
    API:
        t1 * t2
        t1.mul(t2)          #multiply: 乘法

矩阵乘法:
    要求:两个张量,第一个列数 等于 第二个行数
    API:
        t1 @ t2
        t1.matmul(t2)
"""

#导包
import torch

#1.定义函数,演示张量:点乘
def dm01():
    #1.定义张量,2行3列
    t1 = torch.tensor([[1,2,3],[4,5,6]])
    print(t1)

    #2.定义张量,2行3列
    t2 = torch.tensor([[4,5,6],[7,8,9]])
    print(t2)

    #3.演示张量点乘操作
    t3 = t1 * t2    #行列数必须一致
    #t3 = t1.mul(t2)
    print(t3)       #对应元素相乘的结果仍在相应位置,结果还是2行3列

#2.定义函数,演示张量:矩阵乘法
def dm02():
    # 1.定义张量,2行3列
    t1 = torch.tensor([[1, 2, 3], [4, 5, 6]])
    print(t1)

    # 2.定义张量,3行4列
    t2 = torch.tensor([[4, 5, 6,1], [7, 8, 9,2],[1,2,3,4]])
    print(t2)

    # 3.演示张量点乘操作
    t3 = t1 @ t2  # 第一个张量的列 与第二个张量的行 必须一致
    #t3 = t1.matmul(t2)
    print(t3)     #其结果的矩阵2行4列

#3.测试
if __name__ == '__main__':
    # dm01()
    dm02()