"""
案例:
    演示 张量的 索引操作

分类:
    简单行列索引
    列表索引
    范围索引
    布尔索引
    多维索引
"""

#导包
import torch

#1.设置随机种子
torch.manual_seed(1)

#2.创建随机张量
t1 = torch.randint(1,10,(5,5))
print(t1)
print('-'*50)

#3.演示张量索引操作
#场景1:简单行列索引,格式:张量对象[行,列]
#获取第2行的数据
print(t1[1])
print(t1[1,:])      #效果同上,这里:表示所有列
print(t1[:,2])      #第3列
print('-'*50)

#场景2:列表索引
#返回(0,1),(1,2)两个位置的元素
print(t1[[0,1],[1,2]])
#获取(1,2),(3,4)两个位置的数据
print(t1[[1,3],[2,4]])      #前面的[]表示行,后面的[]表示列
#获取第0,1行的1,2列共4个元素
print(t1[[[0],[1]],[1,2]])
print('-'*50)

#场景3:范围索引
#前3行,前2列
print(t1[:3,:2])
#第2行到最后一行,前2列
print(t1[1:,:2])
#索引奇数(索引)行,偶数(索引)列
print(t1[1::2,::2])    #行:从1开始,步长为2,即为奇数; 列:从0开始,步长为2,即为偶数
print('-'*50)

#场景4:布尔索引
#第三列大于5的行数据
print(t1[:,t1[2]>5])
print('-'*50)

#场景5:多维索引
#创建一个3维张量,即2个3行4列的矩阵
t2 = torch.randint(1,10,(2,3,4))
print(t2)

#获取0轴上的第1个数据
print(t1[0,:,:])

#获取1轴上的第一个数据
print(t1[:,0,:])

#回去2轴上的第一个数据
print(t1[:,:,0])