"""
案例:
    演示自动微分模块,具体如何求导

回顾:
    权重更新公式:W新 = W旧 - 学习率 * 梯度
    梯度 = 损失函数的倒数

    关于损失函数的倒数,无需我们手动计算,pytorch内置 自动微分模块,专门针对 不同的损失函数求导
    从而实现 结合 反向传播, 更新权重参数 w 和 偏置参数 b

细节:
    只有标量张量才能求导,且大多数底层操作都是 浮点型,记得转型
"""
#导包
import torch

#1.定义变量,记录: 初始的权重w(旧)
#参1:初始值 ;参2:是否自动微分(求导) ;参3:参数类型
w = torch.tensor(10,requires_grad=True,dtype=torch.float)

#2.定义loss变量,表示损失函数
loss = 2 * w ** 2   #loss = 2w² -> 求导:4w

#3.打印梯度函数类型(了解)
# print(f'梯度函数类型:{type(loss.grad_fn)}')

#4.计算梯度.梯度 = 损失函数倒数,计算完毕后会记录到w.grad属性中
# loss.sum().backward()       #保证loss是一个标量
loss.backward()               #这里不加也行,因为y本身就是标量

#5.代入 权重更新公式:w新 = w旧 - 学习率 * 梯度
w.data = w.data - 0.01 * w.grad

#6.打印最终结果
print(f'更新后的权重:{w.data}')